Autodesk.Revit.DB.SolidUtils.FindAllEdgeEndPointsAtVertex(Autodesk.Revit.DB.EdgeEndPoint)
Find all EdgeEndPoints at a vertex identified by the input EdgeEndPoint.
edgeEndPoint:
The input EdgeEndPoint that identifies the vertex.
Returns:
All EdgeEndPoints at the vertex. The input EdgeEndPoint is also included.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to find all EdgeEndPoints at a vertex identified by the input EdgeEndPoint.
Since:
2021